# Module 1 - Introduction to Pandas
## Pandas Part 1

### Introduction

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. You have found out that Austin has one of the largest no-kill animal shelters in the country, and they keep meticulous track of animals that have been taken in and released. However, it is a large file, the online visualization tools provided are terrible, the data is sorted as strings, and the file holds an overwhelming amount  of information. Is there an easy way to look at this data? Can we do this with base Python? Is there a better way?


#### _Our goals today are to be able to_: <br/>

- Import/read data using Pandas
- Identify Pandas objects and manipulate Pandas objects by index and columns
- Filter data using Pandas

#### _Big questions for this lesson_: <br/>
- Why use Pandas? 
 
 (a) Provides methods able analyze data stored in the format Data Scientist most often encounter (.csv, .tsv, or .xlsx). 
 
 (b) Makes it very convenient to load, process, and analyze in the aforementioned formats. 
 
 (c) Along with python visualization packages allows for the visual analysis of tabular data.
 

- When do we want to use NumPy versus Pandas?
- What are the advantages of using Pandas?    
https://stackabuse.com/beginners-tutorial-on-the-pandas-python-library/
- What are the disadvantages of using Pandas?                      
https://wesmckinney.com/blog/apache-arrow-pandas-internals/

- The data structures in Pandas are implemented using series and dataframe classes.  
- A series is a one-dimensional indexed array of some fixed data type.  
- While a dataframe is a two-dimensional data structure like a table where each column contains data of the same type.  
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### Activation:

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=700, height=700>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [1]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la

'pwd' is not recognized as an internal or external command,
operable program or batch file.
'ls' is not recognized as an internal or external command,
operable program or batch file.

In [5]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [6]:
example_csv.head()

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [7]:
#read in your csv here!

jobs_csv = pd.read_csv('data/made_up_jobs.csv')
#remember that it's nice to be able to look at your data, so let's do that here, too.

In [12]:
jobs_csv

   ID            Name                       Job  Years Employed
0   0    Bob Bobberty  Underwater Basket Weaver              13
1   1    Susan Smells             Salad Spinner               5
2   2   Alex Lastname      Productivity Manager               2
3   3         Rudy P.                Being cool              55
4   4         Rudy G.  Being compared to Rudy P              50
5   5  Sir Wellington            Cheese Stacker              10

In [9]:
jobs_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
ID                6 non-null int64
Name              6 non-null object
Job               6 non-null object
Years Employed    6 non-null int64
dtypes: int64(2), object(2)
memory usage: 272.0+ bytes

You can also load in data by using the url of an associated dataset.

In [13]:
shelter_data = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')
# this link is copied directly from the download option for CSV

shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A790578,*Tux,08/30/2019 08:00:00 AM,08/30/2019 08:00:00 AM,09/12/2017,Adoption,Foster,Dog,Neutered Male,1 year,Boxer/Pointer,Black/White
1,A798506,*Drake,08/30/2019 07:26:00 AM,08/30/2019 07:26:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Black/White
2,A798504,*Travis,08/30/2019 06:53:00 AM,08/30/2019 06:53:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Black/Brown
3,A798503,*Annie,08/30/2019 06:50:00 AM,08/30/2019 06:50:00 AM,06/16/2019,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Bearded Collie,Black/Brown
4,A798500,*Monroe,08/30/2019 06:45:00 AM,08/30/2019 06:45:00 AM,06/16/2019,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Bearded Collie,Tricolor/White

Now that we can read in data, let's get more comfortable with our Pandas data structures.

In [14]:
type(shelter_data)

pandas.core.frame.DataFrame

In [15]:
# Now that data is read let's look at it's shape
print(shelter_data.shape)

(106877, 12)

In [16]:
# What are the names of the columns
print(shelter_data.columns)

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [17]:
# What are the different data types present in our data
print(shelter_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106877 entries, 0 to 106876
Data columns (total 12 columns):
Animal ID           106877 non-null object
Name                73287 non-null object
DateTime            106877 non-null object
MonthYear           106877 non-null object
Date of Birth       106877 non-null object
Outcome Type        106870 non-null object
Outcome Subtype     48695 non-null object
Animal Type         106877 non-null object
Sex upon Outcome    106874 non-null object
Age upon Outcome    106865 non-null object
Breed               106877 non-null object
Color               106877 non-null object
dtypes: object(12)
memory usage: 9.8+ MB
None

In [18]:
# We can find the type of a particular columns in a data frame in this way.
ID_series = shelter_data['Animal ID']
shelter_data['Animal ID'].dtypes

dtype('O')

In [19]:
#remove spaces from columns
shelter_data.columns = [x.replace(' ', '') for x in shelter_data.columns]
shelter_data.columns

Index(['AnimalID', 'Name', 'DateTime', 'MonthYear', 'DateofBirth',
       'OutcomeType', 'OutcomeSubtype', 'AnimalType', 'SexuponOutcome',
       'AgeuponOutcome', 'Breed', 'Color'],
      dtype='object')

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [21]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)
type(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

list

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [22]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [23]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [24]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# create custom indices for your series
ind = ['a','b','c','d','e']

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(list_of_lists, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

a      [cat]
b      [dog]
c    [horse]
d      [cow]
e    [macaw]
dtype: object

pandas.core.series.Series

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [27]:
#list with dictionary objects
student_dict = [
    {'name': 'Samantha', 'age': 35, 'city': 'Houston'},
    {'name': 'Alex', 'age': 17, 'city': 'Seattle'}
]

students_df = pd.DataFrame(student_dict)

students_df.head()

   age     city      name
0   35  Houston  Samantha
1   17  Seattle      Alex

In [37]:
# Dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

  age      city      name
0  35   Houston  Samantha
1  17   Seattle      Alex
2  26  New york     Dante

In [38]:
#to find data types of columns
students_df.dtypes

age     object
city    object
name    object
dtype: object

Let's change the data type of ages to float.

In [40]:
# We can also change a columns type but the change has to make sense.
students_df.age = students_df.age.astype(float)

#Uncomment line below and observe what happens when trying to convert student's name to int or float
# students_df.name = students_df.name.astype(int)

#How about what happens converting numeric to string
# students_df.age = students_df.age.astype(str)

students_df.dtypes

age     float64
city     object
name     object
dtype: object

In [39]:
students_df = students_df.astype({'age': float})
students_df.dtypes

age     float64
city     object
name     object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [41]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

     age      city      name
1111  35   Houston  Samantha
1145  17   Seattle      Alex
0096  26  New york     Dante

Using Pandas, we can also rename column names.

In [42]:
students_df.columns = ['NAME', 'AGE', 'HOME']
students_df.head()

     NAME       AGE      HOME
1111   35   Houston  Samantha
1145   17   Seattle      Alex
0096   26  New york     Dante

Or, we can also change the column names using the rename function.

In [43]:
students_df.rename(columns={'AGE': 'YEARS'})

     NAME     YEARS      HOME
1111   35   Houston  Samantha
1145   17   Seattle      Alex
0096   26  New york     Dante

In [44]:
# Notice what happens when we print students_df

students_df

     NAME       AGE      HOME
1111   35   Houston  Samantha
1145   17   Seattle      Alex
0096   26  New york     Dante

In [45]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

     NAME     YEARS      HOME
1111   35   Houston  Samantha
1145   17   Seattle      Alex
0096   26  New york     Dante

Similarly, there is a tool to remove rows and columns from your DataFrame

In [48]:
students_df.drop(axis=1,labels=['YEARS', 'HOME'])

     NAME
1111   35
1145   17
0096   26

In [49]:
#Notice again what happens if we print students_df 
students_df

     NAME     YEARS      HOME
1111   35   Houston  Samantha
1145   17   Seattle      Alex
0096   26  New york     Dante

In [50]:
students_df.drop(axis = 1, labels=['YEARS', 'HOME'], inplace=True)
students_df

     NAME
1111   35
1145   17
0096   26

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [52]:
l = [1, 2, 3, 4, 5]
l[[0, 4]]
#can only index one at a time

TypeError: list indices must be integers or slices, not list

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [53]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [54]:
students_df

  age      city      name
0  35   Houston  Samantha
1  17   Seattle      Alex
2  26  New york     Dante

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [55]:
# returns the first row
students_df.iloc[0]

age           35
city     Houston
name    Samantha
Name: 0, dtype: object

In [56]:
# returns the first column
students_df.iloc[:, 0]

0    35
1    17
2    26
Name: age, dtype: object

In [57]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

  age     city      name
0  35  Houston  Samantha
1  17  Seattle      Alex

In [58]:
# returns the first two columns
students_df.iloc[:, 0:2]

  age      city
0  35   Houston
1  17   Seattle
2  26  New york

In [59]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

  age     city
0  35  Houston

### How would we use `.iloc` to return the last item in the last row?

In [60]:
# return the last item in the last row using iloc
students_df.iloc[-1,-1]

'Dante'

### How would we use `.iloc` to return the last item in the last column?

In [61]:
# return the last item in the last column using iloc
students_df.iloc[-1,-1]

'Dante'

### What if we only want certain columns or rows?

In [62]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

  age      city      name
0  35   Houston  Samantha
2  26  New york     Dante

In [63]:
students_df.iloc[[0, 2], [0, 2]]

  age      name
0  35  Samantha
2  26     Dante

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [64]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

  age      city      name
0  35   Houston  Samantha
1  17   Seattle      Alex
2  26  New york     Dante

In [65]:
# returns the student information associated with index 0
students_df.loc[0]

age           35
city     Houston
name    Samantha
Name: 0, dtype: object

In [66]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

  age      city      name
0  35   Houston  Samantha
1  17   Seattle      Alex
2  26  New york     Dante

In [67]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

0    35
1    17
2    26
Name: age, dtype: object

In [68]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [69]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [70]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [71]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [72]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [73]:
# What should we get now?
students_df.loc[[0, 2], ['name', 'city']]

KeyError: 'None of [[0, 2]] are in the [index]'

In [74]:
# What should we get now?
students_df.loc[['5', '11'], ['name', 'city']]

        name     city
5   Samantha  Houston
11      Alex  Seattle

In [75]:
students_df.set_index("name", inplace=True)
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [76]:
students_df.loc[['Samantha']]

         age     city
name
Samantha  35  Houston

In [77]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

         age      city
name
Samantha  35   Houston
Dante     26  New york

In [78]:
# Samantha to the end
students_df.loc['Samantha':]

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [ ]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [79]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [80]:
# The statement data[‘name’] == ‘Samantha’] produces a Pandas Series with a True/False value for every row
# in the ‘data’ DataFrame, where there are “True” values for the rows where the name is “Samantha”.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

  age     city      name    state
0  35  Houston  Samantha    Texas
3  21  Atlanta  Samantha  Georgia

In [81]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [82]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']

  age     city      name    state
3  21  Atlanta  Samantha  Georgia

In [83]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

  age     city      name    state
3  21  Atlanta  Samantha  Georgia

In [84]:
# What should be returned?
students_df.loc[(students_df['age'] == '35') &
                (students_df['city'] == 'Atlanta')]

Empty DataFrame
Columns: [age, city, name, state]
Index: []

### Lesson Recap
Pandas combines the power of python lists (selection via integer location) and dictionaries (selection by label)

`.iloc` is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

`.iloc` will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing (this conforms with python/numpy slice semantics).

`.loc` is primarily label based, but may also be used with a boolean array.

#### Warning Note that contrary to usual python slices, both the start and the stop are included.

`.loc` will raise a keyError when any items are not found.

### Pandas
- The data structures in Pandas are implemented using series and dataframe classes.  
- A series is a one-dimensional indexed array of some fixed data type.  
- While a dataframe is a two-dimensional data structure like a table where each column contains data of the same type.  
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### CLASS ASSIGNMENT
Now that we have all of these new tools in our tool belt, use these tools on the shelter data set! 
- Use `shelter_data.columns` to get the list of column names.
- Subset the data by '`Outcome Subtype`.
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column. 
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column with only `Cat`. 
- Play around with your new tools on the data set.
- For extra credit: What are the data types returned from the different subsetting? Is what returned a series or dataframe?

In [85]:
import pandas as pd
shelter_data = pd.read_csv(
    'https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')
shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A799999,*Hovie,08/30/2019 09:41:00 AM,08/30/2019 09:41:00 AM,09/15/2018,Adoption,Foster,Dog,Neutered Male,11 months,Plott Hound,Brown Brindle/White
1,A803245,NaN,08/30/2019 09:40:00 AM,08/30/2019 09:40:00 AM,08/29/2018,Euthanasia,Rabies Risk,Other,Unknown,1 year,Bat,Brown
2,A803267,NaN,08/30/2019 09:35:00 AM,08/30/2019 09:35:00 AM,08/30/2013,Euthanasia,At Vet,Dog,Intact Male,NaN,Cairn Terrier Mix,Brown
3,A790578,*Tux,08/30/2019 08:00:00 AM,08/30/2019 08:00:00 AM,09/12/2017,Adoption,Foster,Dog,Neutered Male,1 year,Boxer/Pointer,Black/White
4,A798506,*Drake,08/30/2019 07:26:00 AM,08/30/2019 07:26:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Black/White

In [86]:
shelter_data.columns

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [98]:
import numpy as np

In [117]:
outcome_subtypes = list(shelter_data['Outcome Subtype'].unique())
outcome_subtypes.remove(np.nan)
outcome_subtypes
# outcome_subtypes_dfs = [s.replace(' ', '_') + "_df" for s in outcome_subtypes]
# [print(s) for s in outcome_subtypes_dfs]

['Foster',
 'Rabies Risk',
 'At Vet',
 'Partner',
 'Snr',
 'Suffering',
 'Aggressive',
 'In Kennel',
 'In Foster',
 'Enroute',
 'Possible Theft',
 'Offsite',
 'Field',
 'In Surgery',
 'Behavior',
 'Medical',
 'Customer S',
 'Underage',
 'Barn',
 'Court/Investigation',
 'SCRP']

In [119]:
shelter_subtype_dict = {}
for subtype in outcome_subtypes:
    shelter_subtype_dict[subtype.replace(' ', '_')+'_df'] = shelter_data.loc[shelter_data['Outcome Subtype'] == subtype]
shelter_subtype_dict.keys()

dict_keys(['Foster_df', 'Rabies_Risk_df', 'At_Vet_df', 'Partner_df', 'Snr_df', 'Suffering_df', 'Aggressive_df', 'In_Kennel_df', 'In_Foster_df', 'Enroute_df', 'Possible_Theft_df', 'Offsite_df', 'Field_df', 'In_Surgery_df', 'Behavior_df', 'Medical_df', 'Customer_S_df', 'Underage_df', 'Barn_df', 'Court/Investigation_df', 'SCRP_df'])

In [121]:
shelter_subtype_dict['Foster_df']

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A799999,*Hovie,08/30/2019 09:41:00 AM,08/30/2019 09:41:00 AM,09/15/2018,Adoption,Foster,Dog,Neutered Male,11 months,Plott Hound,Brown Brindle/White
3,A790578,*Tux,08/30/2019 08:00:00 AM,08/30/2019 08:00:00 AM,09/12/2017,Adoption,Foster,Dog,Neutered Male,1 year,Boxer/Pointer,Black/White
4,A798506,*Drake,08/30/2019 07:26:00 AM,08/30/2019 07:26:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Black/White
5,A798504,*Travis,08/30/2019 06:53:00 AM,08/30/2019 06:53:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Black/Brown
6,A798503,*Annie,08/30/2019 06:50:00 AM,08/30/2019 06:50:00 AM,06/16/2019,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Bearded Collie,Black/Brown
7,A798500,*Monroe,08/30/2019 06:45:00 AM,08/30/2019 06:45:00 AM,06/16/2019,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Bearded Collie,Tricolor/White
8,A798502,*Mary,08/30/2019 06:42:00 AM,08/30/2019 06:42:00 AM,06/16/2019,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Bearded Collie,Black/Brown
9,A798499,*Eva,08/30/2019 06:38:00 AM,08/30/2019 06:38:00 AM,06/16/2019,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Bearded Collie,Sable
55,A796994,*Zuko,08/29/2019 11:34:00 AM,08/29/2019 11:34:00 AM,05/17/2019,Adoption,Foster,Cat,Neutered Male,3 months,Domestic Shorthair,Blue Tabby
56,A800475,*Grace,08/29/2019 11:26:00 AM,08/29/2019 11:26:00 AM,06/14/2019,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair,Brown Tabby
57,A800474,*Will,08/29/2019 11:23:00 AM,08/29/2019 11:23:00 AM,07/06/2019,Adoption,Foster,Cat,Neutered Male,1 month,Domestic Shorthair,Brown Tabby
58,A798826,NaN,08/29/2019 10:32:00 AM,08/29/2019 10:32:00 AM,06/09/2019,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair Mix,White/Buff
59,A798827,NaN,08/29/2019 10:32:00 AM,08/29/2019 10:32:00 AM,06/09/2019,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair Mix,Orange Tabby/White
60,A796281,*Rosie,08/29/2019 07:23:00 AM,08/29/2019 07:23:00 AM,05/30/2018,Adoption,Foster,Cat,Spayed Female,1 year,Domestic Shorthair,Orange Tabby
89,A793463,Yui,08/28/2019 12:07:00 PM,08/28/2019 12:07:00 PM,03/10/2019,Adoption,Foster,Cat,Spayed Female,5 months,Siamese Mix,Lynx Point
109,A800487,*Muffin,08/28/2019 10:58:00 AM,08/28/2019 10:58:00 AM,07/22/2018,Adoption,Foster,Dog,Spayed Female,1 year,Rat Terrier,Black/Tan
110,A797351,*Vincent,08/28/2019 10:31:00 AM,08/28/2019 10:31:00 AM,05/19/2019,Adoption,Foster,Cat,Neutered Male,3 months,Domestic Shorthair,Brown Tabby/White
112,A793915,*Badger,08/28/2019 07:48:00 AM,08/28/2019 07:48:00 AM,05/02/2017,Adoption,Foster,Dog,Spayed Female,2 years,German Shepherd Mix,Brown/White
113,A798012,NaN,08/28/2019 07:34:00 AM,08/28/2019 07:34:00 AM,05/20/2019,Adoption,Foster,Cat,Neutered Male,3 months,Domestic Shorthair,Orange Tabby
143,A797945,*Lucy,08/27/2019 01:15:00 PM,08/27/2019 01:15:00 PM,05/04/2019,Adoption,Foster,Cat,Spayed Female,3 months,Domestic Medium Hair,White/Black
144,A800869,*Sage,08/27/2019 01:01:00 PM,08/27/2019 01:01:00 PM,06/21/2019,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair,Gray Tabby
146,A800867,*Fennel,08/27/2019 12:38:00 PM,08/27/2019 12:38:00 PM,06/21/2019,Adoption,Foster,Cat,Neutered Male,2 months,Domestic Shorthair,Brown Tabby
147,A796283,*Sandy,08/27/2019 12:29:00 PM,08/27/2019 12:29:00 PM,05/27/2019,Adoption,Foster,Cat,Spayed Female,3 months,Domestic Shorthair,Cream Tabby
148,A796618,*Moony,08/27/2019 12:29:00 PM,08/27/2019 12:29:00 PM,05/27/2019,Adoption,Foster,Cat,Neutered Male,3 months,Domestic Shorthair,Brown Tabby/White
150,A799042,*Quince,08/27/2019 11:42:00 AM,08/27/2019 11:42:00 AM,06/03/2019,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair,Tortie
160,A798509,*Wilson,08/27/2019 10:55:00 AM,08/27/2019 10:55:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Sable
161,A798508,*Milton,08/27/2019 10:52:00 AM,08/27/2019 10:52:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Tricolor
162,A798507,*Newton,08/27/2019 10:45:00 AM,08/27/2019 10:45:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Black/Brown
163,A769675,Puppy Dog,08/27/2019 10:28:00 AM,08/27/2019 10:28:00 AM,04/08/2017,Adoption,Foster,Dog,Neutered Male,2 years,Rottweiler Mix,Black/Brown
164,A796940,*Zoro,08/27/2019 10:20:00 AM,08/27/2019 10:20:00 AM,04/27/2019,Adoption,Foster,Cat,Neutered Male,4 months,Domestic Shorthair,Brown Tabby/White
...,...,...,...,...,...,...,...,...,...,...,...,...
106232,A651093,Lucy,10/13/2013 01:01:00 PM,10/13/2013 01:01:00 PM,10/04/2003,Adoption,Foster,Cat,Spayed Female,10 years,Domestic Shorthair Mix,Orange Tabby
106312,A658664,*Sandy,10/11/2013 07:14:00 PM,10/11/2013 07:14:00 PM,07/13/2005,Adoption,Foster,Dog,Spayed Female,8 years,Labrador Retriever/Chow Chow,Tan
106321,A664157,Ponyo,10/11/2013 05:30:00 PM,10/11/2013 05:30:00 PM,08/09/2013,Adoption,Foster,Dog,Spayed Female,2 months,Chihuahua Shorthair Mix,Tricolor
106357,A659836,*Thelma,10/11/2013 10:10:00 AM,10/11/2013 10:10:00 AM,07/23/2013,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Doberman Pinsch,Black
106410,A628590,*Jackson,10/10/2013 02:27:00 PM,10/10/2013 02:27:00 PM,05/30/2008,Adoption,Foster,Dog,Neutered Male,5 years,Australian Cattle Dog Mix,White/Black
106447,A658212,Bobo,10/10/2013 10:31:00 AM,10/10/2013 10:31:00 AM,06/07/2013,Adoption,Foster,Dog,Neutered Male,4 months,Chihuahua Shorthair Mix,Buff
106464,A660822,*Maddie,10/09/2013 06:36:00 PM,10/09/2013 06:36:00 PM,07/12/2013,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair Mix,Brown Tabby/White
106505,A664449,Roxie,10/08/2013 06:24:00 PM,10/08/2013 06:24:00 PM,10/03/2008,Adoption,Foster,Dog,Spayed Female,5 years,Yorkshire Terrier Mix,Tan
106518,A661783,*Gwen,10/08/2013 04:00:00 PM,10/08/2013 04:00:00 PM,07/03/2013,Adoption,Foster,Cat,Spayed Female,3 months,Domestic Medium Hair Mix,Brown Tabby/White
106523,A662921,Oliver,10/08/2013 11:44:00 AM,10/08/2013 11:44:00 AM,07/20/2013,Adoption,Foster,Cat,Neutered Male,2 months,Domestic Medium Hair Mix,Blue Tabby
106524,A662923,*Monty,10/08/2013 11:44:00 AM,10/08/2013 11:44:00 AM,07/20/2013,Adoption,Foster,Cat,Neutered Male,2 months,Domestic Medium Hair Mix,Brown Tabby
106534,A590251,Sunny,10/07/2013 06:21:00 PM,10/07/2013 06:21:00 PM,12/13/2008,Adoption,Foster,Dog,Spayed Female,4 years,Australian Shepherd Mix,Black/Blue Merle
106535,A659172,Lexi,10/07/2013 06:00:00 PM,10/07/2013 06:00:00 PM,06/05/2013,Adoption,Foster,Dog,Spayed Female,4 months,Chihuahua Shorthair Mix,Black/Tan
106543,A661112,Peggy,10/07/2013 04:57:00 PM,10/07/2013 04:57:00 PM,02/16/2012,Adoption,Foster,Cat,Spayed Female,1 year,Domestic Longhair,White/Black
106544,A661775,Albert,10/07/2013 04:56:00 PM,10/07/2013 04:56:00 PM,08/24/2011,Adoption,Foster,Cat,Neutered Male,2 years,Siamese Mix,Blue Point
106545,A659832,*Cooper,10/07/2013 04:17:00 PM,10/07/2013 04:17:00 PM,07/23/2013,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Rhod Ridgeback,Brown
106552,A661612,NaN,10/07/2013 03:49:00 PM,10/07/2013 03:49:00 PM,07/07/2013,Adoption,Foster,Dog,Neutered Male,3 months,Chihuahua Shorthair Mix,White/Buff
106600,A662647,*Lucy,10/06/2013 03:35:00 PM,10/06/2013 03:35:00 PM,07/30/2013,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair Mix,Torbie
106654,A659471,*Sprinkles,10/05/2013 04:52:00 PM,10/05/2013 04:52:00 PM,06/10/2013,Adoption,Foster,Cat,Neutered Male,3 months,Domestic Shorthair Mix,Orange Tabby
106661,A663269,Toonchi,10/05/2013 03:26:00 PM,10/05/2013 03:26:00 PM,07/02/2013,Adoption,Foster,Cat,Neutered Male,3 months,Domestic Shorthair Mix,Orange Tabby
106669,A662167,*Pop Tart,10/05/2013 02:31:00 PM,10/05/2013 02:31:00 PM,07/15/2013,Adoption,Foster,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Blue Tabby/White
106673,A660154,*Owen,10/05/2013 01:55:00 PM,10/05/2013 01:55:00 PM,06/12/2013,Adoption,Foster,Cat,Neutered Male,3 months,Domestic Shorthair Mix,Black/White
106718,A661160,*Creamsicle,10/04/2013 01:05:00 PM,10/04/2013 01:05:00 PM,07/01/2013,Adoption,Foster,Cat,Spayed Female,3 months,Domestic Shorthair Mix,Cream Tabby
106723,A659835,*Moon Doggie,10/04/2013 09:17:00 AM,10/04/2013 09:17:00 AM,07/23/2013,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Doberman Pinsch,Black
106724,A661097,Remi,10/04/2013 09:13:00 AM,10/04/2013 09:13:00 AM,08/15/2012,Adoption,Foster,Cat,Neutered Male,1 year,Domestic Shorthair Mix,Orange Tabby
106747,A658253,Nugget,10/03/2013 03:15:00 PM,10/03/2013 03:15:00 PM,07/08/2011,Adoption,Foster,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Orange Tabby
106753,A660088,*Rooster,10/03/2013 12:50:00 PM,10/03/2013 12:50:00 PM,06/18/2013,Adoption,Foster,Dog,Neutered Male,3 months,Pit Bull Mix,Blue/White
106804,A660455,*Margot,10/02/2013 03:00:00 PM,10/02/2013 03:00:00 PM,07/07/2013,Adoption,Foster,Cat,Spayed Female,2 months,Snowshoe Mix,Lilac Point
106827,A660781,*Hank,10/02/2013 08:31:00 AM,10/02/2013 08:31:00 AM,06/24/2013,Adoption,Foster,Dog,Neutered Male,3 months,Labrador Retriever Mix,Black/White
106879,A659834,*Dudley,10/01/2013 09:31:00 AM,10/01/2013 09:31:00 AM,07/23/2013,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever Mix,Black

## Assessment & Reflection

- One thing you did not know before?
- Two things you want to remember?
- One thing you're still confused by?

In [ ]:
# one line column name cleaning and removing of spaces